IRP/src/Documents/ProductionPlanningCorrection/ProductionPlanningCorrection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanningCorrection</name>
  <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovedDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Productions</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrentQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BillOfMaterialsList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ReleaseStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>SemiproductStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>IsProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsSemiproduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsMaterial</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PlanningPeriod</name>
      <type>
        <types>CatalogRef.PlanningPeriods</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisUnit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedBasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R7030T_ProductionPlanning/R7030T_ProductionPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R7030T_ProductionPlanning</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningDocument</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningType</name>
    <type>
      <types>EnumRef.ProductionPlanningTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.MF_PlanningPeriods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProductionType</name>
    <type>
      <types>EnumRef.ProductionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BillOfMaterials</name>
    <type>
      <types>CatalogRef.MF_BillOfMaterials</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T7010S_BillOfMaterials/T7010S_BillOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T7010S_BillOfMaterials</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>BillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </resources>
 <resources>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>BasisUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>BasisQuantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningDocument</name>
  <type>
   <types>DocumentRef.ProductionPlanning</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BusinessUnit</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>InputID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>OutputID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>UniqueID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>SurplusStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>WriteoffStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsProduct</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsSemiproduct</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsMaterial</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsService</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/ProductionPlanningTypes/ProductionPlanningTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProductionPlanningTypes</name>
 <enumValues>
  <name>Planned</name>
 </enumValues>
 <enumValues>
  <name>Produced</name>
 </enumValues>
 <enumValues>
  <name>PlanAdjustment</name>
 </enumValues>
 <enumValues>
  <name>Closing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ProductionTypes/ProductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionTypes</name>
  <enumValues>
    <name>Product</name>
  </enumValues>
  <enumValues>
    <name>Semiproduct</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Stores/Stores.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Stores</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>UseGoodsReceipt</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UseShipmentConfirmation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Transit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NegativeStockControl</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>Location</name>
  <type>
   <types>CatalogRef.ObjectLocations</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Units/Units.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Units</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Quantity</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>15</precision>
    <scale>5</scale>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>BasisUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>UOM</name>
  <type>
   <types>CatalogRef.UnitsOfMeasurement</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Documents/ProductionPlanningCorrection/ManagerModule.bsl
#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	InfoReg = Metadata.InformationRegisters;
	AccReg  = Metadata.AccumulationRegisters;
	Tables = New Structure();
	Tables.Insert("BillOfMaterials"      , PostingServer.CreateTable(InfoReg.T7010S_BillOfMaterials));
	Tables.Insert("ProductionPlanning"   , PostingServer.CreateTable(AccReg.R7030T_ProductionPlanning));
	Tables.Insert("MaterialPlanning"     , PostingServer.CreateTable(AccReg.R7020T_MaterialPlanning));
	Tables.Insert("DetailingSupplies"    , PostingServer.CreateTable(AccReg.R7010T_DetailingSupplies));
	
	ObjectStatusesServer.WriteStatusToRegister(Ref, Ref.Status, CurrentUniversalDate());
	StatusInfo = ObjectStatusesServer.GetLastStatusInfo(Ref);
	Parameters.Insert("StatusInfo", StatusInfo);
	If Not StatusInfo.Posting Then
		Return Tables;
	EndIf;
	
	BillOfMaterialsTable = GetBillOfMaterials(Ref, GetQueryTex_BillOfMaterialsPlanned());
	MaterialPlanningEmptyTable    = Tables.MaterialPlanning.CopyColumns();
	
	MaterialPlanningTable    = GetMaterialPlanning(BillOfMaterialsTable, MaterialPlanningEmptyTable);
	ProductionPlanningTable  = GetProductionPlanning(BillOfMaterialsTable);
	DetailingSuppliesTable   = GetDetailingSupplies(MaterialPlanningTable);
	BillOfMaterialsTable     = GetBillOfMaterials(Ref, GetQueryText_BillOfMaterialsContent());
		
	Query = New Query();
	Query.TempTablesManager = Parameters.TempTablesManager;
	Query.SetParameter("ProductionPlanningTable" , ProductionPlanningTable);
	Query.SetParameter("DetailingSuppliesTable"  , DetailingSuppliesTable);
	Query.SetParameter("ProductionPlanningTable" , ProductionPlanningTable);
	Query.SetParameter("MaterialPlanningTable"   , MaterialPlanningTable);
	Query.SetParameter("BillOfMaterialsTable"    , BillOfMaterialsTable);
	
	Query.Text = 
	"SELECT
	|	*
	|INTO IncomingStocks
	|FROM
	|	&ProductionPlanningTable AS IncomingStocks
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO DetailingSuppliesTable
	|FROM
	|	&DetailingSuppliesTable AS DetailingSuppliesTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO ProductionPlanningTable
	|FROM
	|	&ProductionPlanningTable AS ProductionPlanningTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO MaterialPlanningTable
	|FROM
	|	&MaterialPlanningTable AS MaterialPlanningTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO BillOfMaterialsTable
	|FROM 
	|	&BillOfMaterialsTable AS BillOfMaterialsTable";
	Query.Execute();
	
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	
	Return Tables;
EndFunction

#Region CreatingTables

Function GetDetailingSupplies(MaterialPlanningTable)
	Query = New Query();
	Query.Text =
	"SELECT
	|	MaterialPlanningTable.Period,
	|	MaterialPlanningTable.Company,
	|	MaterialPlanningTable.BusinessUnit,
	|	MaterialPlanningTable.PlanningPeriod,
	|	MaterialPlanningTable.Store,
	|	MaterialPlanningTable.ItemKey,
	|	MaterialPlanningTable.Quantity
	|INTO tmp
	|FROM
	|	&MaterialPlanningTable AS MaterialPlanningTable
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Period,
	|	tmp.Company,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.Store,
	|	tmp.ItemKey,
	|	SUM(tmp.Quantity) AS CorrectedDemandQuantity
	|FROM
	|	tmp AS tmp
	|GROUP BY
	|	tmp.Period,
	|	tmp.Company,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.Store,
	|	tmp.ItemKey";
	Query.SetParameter("MaterialPlanningTable", MaterialPlanningTable);
	QueryResult = Query.Execute();
	QueryTable =QueryResult.Unload();
	Return QueryTable;
EndFunction

Function GetProductionPlanning(BillOfMaterialsTable)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	BillOfMaterialsTable.ProductionPlanning,
	|	BillOfMaterialsTable.ProductionPlanningBasis,
	|	BillOfMaterialsTable.BusinessUnit,
	|	BillOfMaterialsTable.PlanningPeriod,
	|	BillOfMaterialsTable.ItemKey,
	|	BillOfMaterialsTable.BillOfMaterials,
	|	BillOfMaterialsTable.BasisQuantity AS Quantity,
	|	BillOfMaterialsTable.Period,
	|	BillOfMaterialsTable.Company,
	|	BillOfMaterialsTable.SurplusStore AS Store,
	|	BillOfMaterialsTable.IsProduct,
	|	BillOfMaterialsTable.IsSemiproduct,
	|	BillOfMaterialsTable.IsMaterial,
	|	BillOfMaterialsTable.IsService
	|INTO tmp
	|FROM
	|	&BillOfMaterialsTable AS BillOfMaterialsTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Period,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.BillOfMaterials,
	|	VALUE(Enum.ProductionPlanningTypes.PlanAdjustment) AS PlanningType,
	|	tmp.Company,
	|	tmp.Store,
	|	tmp.ItemKey,
	|	tmp.Quantity,
	|	CASE WHEN tmp.IsProduct = TRUE THEN VALUE(Enum.ProductionTypes.Product)
	|		 WHEN tmp.IsSemiproduct = TRUE THEN VALUE(Enum.ProductionTypes.Semiproduct)
	|	END AS ProductionType,
	|	tmp.ProductionPlanningBasis AS PlanningDocument,
	|	tmp.ProductionPlanningBasis AS Order
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.IsProduct = TRUE OR tmp.IsSemiproduct = TRUE";
	
	Query.SetParameter("BillOfMaterialsTable", BillOfMaterialsTable);
	QueryResult = Query.Execute();
	PlanningTable = QueryResult.Unload();
	Return PlanningTable;
EndFunction

Function GetMaterialPlanning(BillOfMaterialsTable, MaterialPlanningTable)
	TmpManager = New TempTablesManager();
	Query = New Query();
	Query.TempTablesManager = TmpManager;
	Query.Text = 
	"SELECT
	|	BillOfMaterialsTable.ProductionPlanning,
	|   BillOfMaterialsTable.PlanningDocument,
	|	BillOfMaterialsTable.BusinessUnit,
	|	BillOfMaterialsTable.PlanningPeriod,
	|	BillOfMaterialsTable.ItemKey,
	|	BillOfMaterialsTable.BillOfMaterials,
	|	BillOfMaterialsTable.BasisQuantity AS Quantity,
	|	BillOfMaterialsTable.Period,
	|	BillOfMaterialsTable.Company,
	|	BillOfMaterialsTable.WriteoffStore AS Store,
	|	BillOfMaterialsTable.IsProduct,
	|	BillOfMaterialsTable.IsSemiproduct,
	|	BillOfMaterialsTable.IsMaterial,
	|	BillOfMaterialsTable.IsService,
	|	BillOfMaterialsTable.InputID,
	|	BillOfMaterialsTable.OutputID,
	|	BillOfMaterialsTable.UniqueID
	|INTO tmp
	|FROM
	|	&BillOfMaterialsTable AS BillOfMaterialsTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Period,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.PlanningDocument,
	|	tmp.BillOfMaterials,
	|	VALUE(Enum.ProductionPlanningTypes.PlanAdjustment) AS PlanningType,
	|	tmp.Company,
	|	tmp.Store,
	|	tmp.IsSemiproduct,
	|	tmp.ItemKey AS Production,
	|	tmp.OutputID,
	|	tmp.UniqueID
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.IsProduct = TRUE
	|	OR tmp.IsSemiproduct = TRUE";
	
	Query.SetParameter("BillOfMaterialsTable", BillOfMaterialsTable);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	While QuerySelection.Next() Do
		MaterialTable = GetMaterialByProduct(TmpManager, QuerySelection.OutputID, QuerySelection.UniqueID);
		For Each RowMaterial In MaterialTable Do
			NewRow = MaterialPlanningTable.Add();
			FillPropertyValues(NewRow, QuerySelection);
			NewRow.Store    = RowMaterial.Store;
			NewRow.ItemKey  = RowMaterial.ItemKey;
			NewRow.Quantity = RowMaterial.Quantity;
		EndDo;
	EndDo;
	Return MaterialPlanningTable;
EndFunction

Function GetMaterialByProduct(TmpManager, OutputID, UniqueID)
	Query = New Query();
	Query.TempTablesManager = TmpManager;
	Query.Text =
	"SELECT
	|	tmp.ItemKey,
	|	tmp.Store AS Store,
	|	tmp.Quantity
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.InputID = &OutputID
	|	AND CAST(tmp.UniqueID AS STRING(100)) = CAST(&UniqueID AS STRING(100))
	|	AND (tmp.IsMaterial = TRUE
	|	OR tmp.IsSemiproduct = TRUE)";
	Query.SetParameter("OutputID", OutputID);
	Query.SetParameter("UniqueID", UniqueID);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction

Function GetQueryTex_BillOfMaterialsPlanned()
	Return
		"SELECT
		|	DocBillOfMaterials.Ref AS ProductionPlanning,
		|	DocBillOfMaterials.Ref.ProductionPlanning AS PlanningDocument,
		|	DocBillOfMaterials.Ref.ProductionPlanning AS ProductionPlanningBasis,
		|	DocBillOfMaterials.Ref.Company AS Company,
		|	DocBillOfMaterials.Ref.ApprovedDate AS Period,
		|	DocBillOfMaterials.BusinessUnit AS BusinessUnit,
		|	DocBillOfMaterials.PlanningPeriod AS PlanningPeriod,
		|	DocBillOfMaterials.ItemKey AS ItemKey,
		|	CASE
		|		WHEN DocBillOfMaterials.IsMaterial
		|			THEN DocBillOfMaterials.MaterialStore
		|		WHEN DocBillOfMaterials.IsSemiproduct
		|			THEN DocBillOfMaterials.SemiproductStore
		|		ELSE VALUE(Catalog.Stores.EmptyRef)
		|	END AS WriteoffStore,
		|	CASE
		|		WHEN DocBillOfMaterials.IsSemiproduct
		|		OR DocBillOfMaterials.IsProduct
		|			THEN DocBillOfMaterials.ReleaseStore
		|		ELSE VALUE(Catalog.Stores.EmptyRef)
		|	END AS SurplusStore,
		|	DocBillOfMaterials.IsProduct AS IsProduct,
		|	DocBillOfMaterials.IsSemiproduct AS IsSemiproduct,
		|	DocBillOfMaterials.IsMaterial AS IsMaterial,
		|	DocBillOfMaterials.IsService AS IsService,
		|	DocBillOfMaterials.InputID AS InputID,
		|	DocBillOfMaterials.OutputID AS OutputID,
		|	DocBillOfMaterials.UniqueID AS UniqueID,
		|	DocBillOfMaterials.BillOfMaterials AS BillOfMaterials,
		|	DocBillOfMaterials.Unit AS Unit,
		|	DocBillOfMaterials.PlannedQuantity AS Quantity,
		|	DocBillOfMaterials.BasisUnit AS BasisUnit,
		|	DocBillOfMaterials.PlannedBasisQuantity AS BasisQuantity
		|FROM
		|	Document.ProductionPlanningCorrection.BillOfMaterialsList AS DocBillOfMaterials
		|WHERE
		|	DocBillOfMaterials.Ref = &Ref
		|	AND DocBillOfMaterials.PlannedQuantity <> 0";
EndFunction

Function GetQueryText_BillOfMaterialsContent()
	Return
		"SELECT
		|	DocBillOfMaterials.Ref AS ProductionPlanning,
		|	DocBillOfMaterials.Ref.ProductionPlanning AS PlanningDocument,
		|	DocBillOfMaterials.Ref.ProductionPlanning AS ProductionPlanningBasis,
		|	DocBillOfMaterials.Ref.Company AS Company,
		|	DocBillOfMaterials.Ref.ApprovedDate AS Period,
		|	DocBillOfMaterials.BusinessUnit AS BusinessUnit,
		|	DocBillOfMaterials.PlanningPeriod AS PlanningPeriod,
		|	DocBillOfMaterials.ItemKey AS ItemKey,
		|	CASE
		|		WHEN DocBillOfMaterials.IsMaterial
		|			THEN DocBillOfMaterials.MaterialStore
		|		WHEN DocBillOfMaterials.IsSemiproduct
		|			THEN DocBillOfMaterials.SemiproductStore
		|		ELSE VALUE(Catalog.Stores.EmptyRef)
		|	END AS WriteoffStore,
		|	CASE
		|		WHEN DocBillOfMaterials.IsSemiproduct
		|		OR DocBillOfMaterials.IsProduct
		|			THEN DocBillOfMaterials.ReleaseStore
		|		ELSE VALUE(Catalog.Stores.EmptyRef)
		|	END AS SurplusStore,
		|	DocBillOfMaterials.IsProduct AS IsProduct,
		|	DocBillOfMaterials.IsSemiproduct AS IsSemiproduct,
		|	DocBillOfMaterials.IsMaterial AS IsMaterial,
		|	DocBillOfMaterials.IsService AS IsService,
		|	DocBillOfMaterials.InputID AS InputID,
		|	DocBillOfMaterials.OutputID AS OutputID,
		|	DocBillOfMaterials.UniqueID AS UniqueID,
		|	DocBillOfMaterials.BillOfMaterials AS BillOfMaterials,
		|	DocBillOfMaterials.Unit AS Unit,
		|	DocBillOfMaterials.Quantity AS Quantity,
		|	DocBillOfMaterials.BasisUnit AS BasisUnit,
		|	DocBillOfMaterials.BasisQuantity AS BasisQuantity
		|FROM
		|	Document.ProductionPlanningCorrection.BillOfMaterialsList AS DocBillOfMaterials
		|WHERE
		|	DocBillOfMaterials.Ref = &Ref
		|	AND DocBillOfMaterials.PlannedQuantity <> 0";
EndFunction

Function GetBillOfMaterials(Ref, QueryText)
	Query = New Query();
	Query.Text = QueryText;
	Query.SetParameter("Ref", Ref);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction

#EndRegion

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	If Parameters.StatusInfo.Posting Then
		Tables = Parameters.DocumentDataTables;	
		QueryArray = GetQueryTextsMasterTables();
		PostingServer.SetRegisters(Tables, Ref);
		PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
	EndIf;
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Tables = PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(T7010S_BillOfMaterials());
	QueryArray.Add(R7030T_ProductionPlanning());
	QueryArray.Add(R7020T_MaterialPlanning());
	QueryArray.Add(R7010T_DetailingSupplies());
	Return QueryArray;	
EndFunction	

Function T7010S_BillOfMaterials()
	Return
		"SELECT * 
		|INTO T7010S_BillOfMaterials
		|FROM BillOfMaterialsTable AS BillOfMaterialsTable
		|WHERE
		|	TRUE";
EndFunction

Function R7030T_ProductionPlanning()
	Return
		"SELECT * 
		|INTO R7030T_ProductionPlanning
		|FROM ProductionPlanningTable AS ProductionPlanningTable
		|WHERE
		|	TRUE";
EndFunction

Function R7020T_MaterialPlanning()
	Return
		"SELECT * 
		|INTO R7020T_MaterialPlanning
		|FROM MaterialPlanningTable AS MaterialPlanningTable
		|WHERE
		|	TRUE";
EndFunction

Function R7010T_DetailingSupplies()
	Return
		"SELECT * 
		|INTO R7010T_DetailingSupplies
		|FROM DetailingSuppliesTable AS DetailingSuppliesTable
		|WHERE
		|	TRUE";
EndFunction

Function GetCurrentQuantity(Company, ProductionPlanning, PlanningPeriod, BillOfMaterials, ItemKey) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	ISNULL(Planned.Company, Correction.Company) AS Company,
	|	ISNULL(Planned.BusinessUnit, Correction.BusinessUnit) AS BusinessUnit,
	|	ISNULL(Planned.ItemKey, Correction.ItemKey) AS ItemKey,
	|	ISNULL(Planned.PlanningType, Correction.PlanningType) AS PlanningType,
	|	ISNULL(Planned.PlanningPeriod, Correction.PlanningPeriod) AS PlanningPeriod,
	|	ISNULL(Planned.BillOfMaterials, Correction.BillOfMaterials) AS BillOfMaterials,
	|	ISNULL(Planned.PlanningDocument, Correction.PlanningDocument) AS PlanningDocument,
	|	MAX(ISNULL(Planned.QuantityTurnover, 0) + ISNULL(Correction.QuantityTurnover, 0)) AS Quantity
	|INTO Planned
	|FROM
	|	AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod = &PlanningPeriod
	|	AND PlanningType = VALUE(Enum.ProductionPlanningTypes.Planned)
	|	AND Company = &Company
	|	AND PlanningDocument = &ProductionPlanning
	|	AND ItemKey = &ItemKey
	|	AND BillOfMaterials = &BillOfMaterials) AS Planned
	|		FULL JOIN AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod = &PlanningPeriod
	|		AND PlanningType = VALUE(Enum.ProductionPlanningTypes.PlanAdjustment)
	|		AND Company = &Company
	|		AND PlanningDocument = &ProductionPlanning
	|		AND ItemKey = &ItemKey
	|		AND BillOfMaterials = &BillOfMaterials) AS Correction
	|		ON Planned.Company = Correction.Company
	|		AND Planned.BusinessUnit = Correction.BusinessUnit
	|		AND Planned.PlanningDocument = Correction.PlanningDocument
	|		AND Planned.ItemKey = Correction.ItemKey
	|		AND Planned.PlanningPeriod = Correction.PlanningPeriod
	|		AND Planned.ProductionType = Correction.ProductionType
	|		AND Planned.BillOfMaterials = Correction.BillOfMaterials
	|GROUP BY
	|	ISNULL(Planned.Company, Correction.Company),
	|	ISNULL(Planned.BusinessUnit, Correction.BusinessUnit),
	|	ISNULL(Planned.ItemKey, Correction.ItemKey),
	|	ISNULL(Planned.PlanningType, Correction.PlanningType),
	|	ISNULL(Planned.PlanningPeriod, Correction.PlanningPeriod),
	|	ISNULL(Planned.PlanningDocument, Correction.PlanningDocument),
	|	ISNULL(Planned.BillOfMaterials, Correction.BillOfMaterials)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Planned.Company AS Company,
	|	Planned.BusinessUnit AS BusinessUnit,
	|	Planned.ItemKey.Item AS Item,
	|	Planned.ItemKey AS ItemKey,
	|	Planned.PlanningPeriod AS PlanningPeriod,
	|	Planned.Quantity AS BasisQuantity,
	|	T7010S_BillOfMaterials.BasisUnit AS BasisUnit,
	|	T7010S_BillOfMaterials.BillOfMaterials AS BillOfMaterials,
	|	T7010S_BillOfMaterials.BasisQuantity AS TotalQuantity,
	|	T7010S_BillOfMaterials.OutputID AS OutputID,
	|	T7010S_BillOfMaterials.UniqueID AS UniqueID
	|INTO Production
	|FROM
	|	Planned AS Planned
	|		INNER JOIN InformationRegister.T7010S_BillOfMaterials.SliceLast AS T7010S_BillOfMaterials
	|		ON (T7010S_BillOfMaterials.Company = Planned.Company)
	|		AND (T7010S_BillOfMaterials.BusinessUnit = Planned.BusinessUnit)
	|		AND (T7010S_BillOfMaterials.ItemKey = Planned.ItemKey)
	|		AND (T7010S_BillOfMaterials.IsProduct = TRUE)
	|		AND (T7010S_BillOfMaterials.PlanningPeriod = Planned.PlanningPeriod)
	|		AND (T7010S_BillOfMaterials.BillOfMaterials = &BillOfMaterials)
	|		AND (T7010S_BillOfMaterials.BillOfMaterials = Planned.BillOfMaterials)
	|		AND (T7010S_BillOfMaterials.PlanningDocument = Planned.PlanningDocument)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Production.Item AS Item,
	|	Production.ItemKey AS ItemKey,
	|	Production.BasisQuantity AS BasisQuantity,
	|	Production.BasisUnit AS BasisUnit,
	|	Production.BillOfMaterials AS BillOfMaterials
	|FROM
	|	Production AS Production
	|WHERE
	|	Production.BasisQuantity > 0";
		
	Query.SetParameter("Company"            , Company);
	Query.SetParameter("ProductionPlanning" , ProductionPlanning);
	Query.SetParameter("PlanningPeriod"     , PlanningPeriod);
	Query.SetParameter("ItemKey"            , ItemKey);
	Query.SetParameter("BillOfMaterials"    , BillOfMaterials);
	
	Result = New Structure("BasisUnit, BasisQuantity", Catalogs.Units.EmptyRef(), 0);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();	
	If QuerySelection.Next() Then
		Result.BasisUnit = QuerySelection.BasisUnit;
		Result.BasisQuantity = QuerySelection.BasisQuantity;
	EndIf;
	Return Result;
EndFunction
